
* Script.py

#+begin_src python :results output
  import pandas as pd
  from sklearn.feature_selection import VarianceThreshold

  df = pd.DataFrame(data={
   'edu_goal': ['bachelors', 'bachelors', 'bachelors', 'masters', 'masters', 'masters', 'masters', 'phd', 'phd', 'phd'],
    'hours_study': [1, 2, 3, 3, 3, 4, 3, 4, 5, 5],
    'hours_TV': [4, 3, 4, 3, 2, 3, 2, 2, 1, 1],
    'hours_sleep': [10, 10, 8, 8, 6, 6, 8, 8, 10, 10],
    'height_cm': [155, 151, 160, 160, 156, 150, 164, 151, 158, 152],
    'grade_level': [8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
    'exam_score': [71, 72, 78, 79, 85, 86, 92, 93, 99, 100]
  })

  # 10 x 6 features matrix
  X = df.drop(columns=['exam_score'])
  print(X)

  # 10 x 1 target vector
  y = df['exam_score']
  print(y)

  # Drop the non-numeric feature
  X_num = X.drop(columns=['edu_goal'])
  print(X_num)

  # Use the VarianceThreshold class
  selector = VarianceThreshold(threshold=0) #0 is default
  print(selector.fit_transform(X_num))

  # Specify indices=True to get indices of selected features
  print(selector.get_support(indices=True))

  # Use indices to get the corresponding column names of selected features
  num_cols = list(X_num.columns[selector.get_support(indices=True)])
  print(num_cols)

  # Subset X_num to retain only selected features
  X_num = X_num[num_cols]
  print(X_num)

  # Obtain our entire features DataFrame (with edu_goal)
  X = X[['edu_goal'] + num_cols]
  print(X)

  ## Pearson's
  import matplotlib.pyplot as plt
  import seaborn as sns

  corr_matrix = X_num.corr(method='pearson')

  sns.heatmap(corr_matrix, annot=True, cmap='RdBu_r')
  plt.show()

  # Loop over bottom diagonal of correlation matrix
  for i in range(len(corr_matrix.columns)):
      for j in range(i):
          # Print variables with high correlation
          if abs(corr_matrix.iloc[i,j]) > 0.7:
              print(corr_matrix.columns[i], corr_matrix.columns[j], corr_matrix.iloc[i,j])

  # New DataFrame with numeric features and 'exam_score'
  X_y = X_num.copy()
  X_y['exam_score'] = y
  print(X_y)

  # Generate the correlation matrix
  corr_matrix = X_y.corr()

  # Isolate the column corresponding to exam_score
  corr_target = corr_matrix[['exam_score']].drop(labels=['exam_score'])

  sns.heatmap(corr_target, annot=True, fmt='.3', cmap='RdBu_r')
  plt.show()

  # Remove hours_TV as the redundant feature
  X = X.drop(columns=['hours_TV'])
  print(X)

  # f_regression() as an alternative to corr_matrix
  from sklearn.feature_selection import f_regression

  print(f_regression(X_num, y))

  ## Mutual Information
  # Using the LabelEncoder class
  from sklearn.preprocessing import LabelEncoder

  le = LabelEncoder()

  # Create copy of X for encoded version
  X_enc = X.copy()
  X_enc['edu_goal'] = le.fit_transform(X['edu_goal'])

  print(X_enc)

  # Use mutual_info_regression
  from sklearn.feature_selection import mutual_info_regression

  print(mutual_info_regression(X_enc, y, random_state=68))

  # Using the discrete features parameter
  print(mutual_info_regression(X_enc, y, discrete_features=[0], random_state=68))

  # Use SelectKBest
  from sklearn.feature_selection import SelectKBest
  from functools import partial

  score_func = partial(mutual_info_regression, discrete_features=[0], random_state=68)

  # Select top 3 features with the most mutual information
  selection = SelectKBest(score_func=score_func, k=3)

  print(selection.fit_transform(X_enc, y))

  # SelectKBest also supports .get_support
  X = X[X.columns[selection.get_support(indices=True)]]

  print(X)

#+end_src

#+RESULTS:
#+begin_example
    edu_goal  hours_study  hours_TV  hours_sleep  height_cm  grade_level
0  bachelors            1         4           10        155            8
1  bachelors            2         3           10        151            8
2  bachelors            3         4            8        160            8
3    masters            3         3            8        160            8
4    masters            3         2            6        156            8
5    masters            4         3            6        150            8
6    masters            3         2            8        164            8
7        phd            4         2            8        151            8
8        phd            5         1           10        158            8
9        phd            5         1           10        152            8
0     71
1     72
2     78
3     79
4     85
5     86
6     92
7     93
8     99
9    100
Name: exam_score, dtype: int64
   hours_study  hours_TV  hours_sleep  height_cm  grade_level
0            1         4           10        155            8
1            2         3           10        151            8
2            3         4            8        160            8
3            3         3            8        160            8
4            3         2            6        156            8
5            4         3            6        150            8
6            3         2            8        164            8
7            4         2            8        151            8
8            5         1           10        158            8
9            5         1           10        152            8
[[  1   4  10 155]
 [  2   3  10 151]
 [  3   4   8 160]
 [  3   3   8 160]
 [  3   2   6 156]
 [  4   3   6 150]
 [  3   2   8 164]
 [  4   2   8 151]
 [  5   1  10 158]
 [  5   1  10 152]]
[0 1 2 3]
['hours_study', 'hours_TV', 'hours_sleep', 'height_cm']
   hours_study  hours_TV  hours_sleep  height_cm
0            1         4           10        155
1            2         3           10        151
2            3         4            8        160
3            3         3            8        160
4            3         2            6        156
5            4         3            6        150
6            3         2            8        164
7            4         2            8        151
8            5         1           10        158
9            5         1           10        152
    edu_goal  hours_study  hours_TV  hours_sleep  height_cm
0  bachelors            1         4           10        155
1  bachelors            2         3           10        151
2  bachelors            3         4            8        160
3    masters            3         3            8        160
4    masters            3         2            6        156
5    masters            4         3            6        150
6    masters            3         2            8        164
7        phd            4         2            8        151
8        phd            5         1           10        158
9        phd            5         1           10        152
hours_TV hours_study -0.780763315142435
   hours_study  hours_TV  hours_sleep  height_cm  exam_score
0            1         4           10        155          71
1            2         3           10        151          72
2            3         4            8        160          78
3            3         3            8        160          79
4            3         2            6        156          85
5            4         3            6        150          86
6            3         2            8        164          92
7            4         2            8        151          93
8            5         1           10        158          99
9            5         1           10        152         100
    edu_goal  hours_study  hours_sleep  height_cm
0  bachelors            1           10        155
1  bachelors            2           10        151
2  bachelors            3            8        160
3    masters            3            8        160
4    masters            3            6        156
5    masters            4            6        150
6    masters            3            8        164
7        phd            4            8        151
8        phd            5           10        158
9        phd            5           10        152
(array([3.61362007e+01, 3.44537037e+01, 0.00000000e+00, 1.70259066e-03]), array([3.19334945e-04, 3.74322763e-04, 1.00000000e+00, 9.68097878e-01]))
   edu_goal  hours_study  hours_sleep  height_cm
0         0            1           10        155
1         0            2           10        151
2         0            3            8        160
3         1            3            8        160
4         1            3            6        156
5         1            4            6        150
6         1            3            8        164
7         2            4            8        151
8         2            5           10        158
9         2            5           10        152
[0.50396825 0.40896825 0.         0.        ]
[0.75563492 0.38896825 0.11896825 0.        ]
[[ 0  1 10]
 [ 0  2 10]
 [ 0  3  8]
 [ 1  3  8]
 [ 1  3  6]
 [ 1  4  6]
 [ 1  3  8]
 [ 2  4  8]
 [ 2  5 10]
 [ 2  5 10]]
    edu_goal  hours_study  hours_sleep
0  bachelors            1           10
1  bachelors            2           10
2  bachelors            3            8
3    masters            3            8
4    masters            3            6
5    masters            4            6
6    masters            3            8
7        phd            4            8
8        phd            5           10
9        phd            5           10
#+end_example
